---
kind: type
id: T:Autodesk.Revit.DB.PlanTopologySet
source: html/37cd93b8-bed4-0000-a389-48d5305d908e.htm
---
# Autodesk.Revit.DB.PlanTopologySet

A set that can contain any number of plan topology objects.

## Syntax (C#)
```csharp
public class PlanTopologySet : APIObject,
	IEnumerable
```